'use strict';

export const ROLEPLAY_ERROR = {


	'900000':'长时间未操作,请重新登录',
	'900001':'UUID缺失,请重新登录',
	
	//销售模块
	'100000':'创建订单的时候需要提供客户',
	'100001':'创建订单的时候需要提供创建者',
	'100002':'不能创建一个空的销售订单',
	'100003':'订单未找到',
	'100004':'交付日期不能为空',
	'100005':'订单号不能为空',
	'100006':'交付日期不能早于或等于当前时间',
	'100007':'订单号重复了',
	'100008':'订单存在已生效的收款纪录,无法被中止',
	'100009':'导出PDF失败',
	'100010':'导出EXCEL失败',
	'100011':'收款失败,订单总金额的收款已经完成或正在审批中',
	'100012':'入库失败,订单总数量的入库操作已经完成或正在审批中',
	'100013':'出库失败,订单总数量的出库操作已经完成或正在审批中',

	//基础数据 产品类型
	'100100':'产品类型名不能为空',
	'100101':'产品类型名已存在',
	'100102':'错误的产品类型',
	'100103':'错误的产品类型',
	'100104':'产品类型未找到',
	'100105':'产品类型层级不能大于3层',
	'100106':'产品类型被使用,不能删除',

	//基础数据 产品属性
	'100120':'错误的产品属性',
	'100121':'产品属性名已存在',
	'100122':'产品编码已存在',
	'100123':'产品属性不能为空',
	'100124':'属性排序值不能为空',
	'100125':'错误的属性值',
	'100126':'错误的属性值',
	'100127':'属性值被使用,不能删除',

	//基础数据 SPU
	'100140':'错误的物料',
	'100141':'错误的物料类型',
	'100142':'物料编码不能空',
	'100143':'物料编码已存在',
	'100144':'物料编码已存在',
	'100145':'物料名不能为空',
	'100146':'物料名已存在',
	'100147':'物料类型不能为空',
	'100148':'错误的物料类型',
	'100149':'错误的生产模式',
	'100150':'组织不能为空',
	'100151':'错误的组织',
	'100152':'错误的BOM信息',
	'100153':'错误的状态信息',
	'100154':'错误的计量单位类型',
	'100155':'错误的计量单位',
	'100156':'BOM数量不能为空',
	'100157':'SPU被使用、不能删除',
	'100158':'损耗率不能为空',
	'100159':'损耗率必须大于等于0小于1',


	//基础数据  SKU
	'100160':'错误的物料',
	'100161':'错误的物料类型',
	'100162':'物料不存在',
	'100163':'物料编码不能空',
	'100164':'物料编码已存在',
	'100165':'物料名不能为空',
	'100166':'物料名已存在',
	'100167':'物料类型不能为空',
	'100168':'错误的物料类型',
	'100169':'错误的生产模式',
	'100170':'组织不能为空',
	'100171':'错误的组织',
	'100172':'错误的BOM信息',
	'100173':'错误的状态信息',
	'100174':'皮费不能为空',
	'100175':'损耗率大于等于0小于1',
	'100176':'生成方式不能为空',
	'100177':'交付方式不能为空',
	'100178':'是否参与计算不能为空',
	'100179':'SKU被使用、不能删除',
	'100280':'SKU属性值组合已存在',
	
	//基础数据 费用
	'100220':'费用名称重复',
	'100221':'费用类型不存在',
	'100222':'费用不存在',

	//通讯录公共模块 错误码
	'102000':'负责人不存在',
	'102002':'手机格式不正确',
	'102003':'邮箱格式不正确',
	'102001':'前端参数请求非法',


	//组织错误码
	'102100':'添加或修改的时候父组织不存在',
	'102101':'组织树不能超过三层',
	'102102':'组织重名',
	'102105':'该组织不存在',
	'102104':'有子组织，不能删除',

	//角色错误码
	'102200':'添加或修改的时候父角色不存在',
	'102201':'角色树不能超过三层',
	'102202':'角色重名',
	'102204':'角色不存在',
	'102203':'有子角色，不能删除',
	'102106':'负责人不能移除组织',

	//用户添加错误码
	'102300':'用户账户重复',
	'102301':'手机重复',
	'102302':'邮箱重复',
	'102303':'用户不存在',
	'102305':'此状态不允许修改',
	'102304':'有子组织，不能删除',
	'102107':'组织下有用户，不能删除',
	'102205':'角色下有用户，不能删除',

	//商业圈错误码
	'102400':'客户名称重复',
	'102402':'合作伙伴名称重复',
	'102401':'客户不存在',
	'102405':'供应商不存在',
	'102406':'合作伙伴不存在',
	'102407':'股东不存在',
	'102403':'供应商名称重复',
	'102404':'股东名称重复',

	//工序错误码
	'100180':'错误的标识',
	'100181':'不存在的工序',
	'100182':'工序名不能为空',
	'100183':'工序组不能为空',
	'100184':'工序名已存在',
	'100185':'计费类型不能为空',

	//工价错误码
	'100200':'错误的标识',
	'100201':'不存在的工价',
	'100202':'工价名不能为空',
	'100203':'工价名已存在',
	'100204':'计费类型不能为空' ,
	'100205':'错误的计费类型',
	'100206':'数量不能为空',
	'100207':'工价不能为空',

	//工作流错误码
	'200000':'bpmn文件不存在',
	'200001':'bpmn文件读取失败',
	'200002':'bpmn文件部署失败',
	'200003':'bpmn文件反部署失败',
	'200004':'表单配置文件读取失败',
	'200005':'流程实例ID为空',
	'200006':'表单保存失败',
	'200007':'表单计算失败',
	'200008':'流程类型id为空',
	'200010':'任务不存在',
	'200011':'第一个任务不能是审核',
	'200012':'用户没有权限操作此任务',
	'200013':'表单获取失败',
	'200014':'流程类型不存在',
	'200015':'流程不存在或流程已结束',
	'200016':'生成工作流图失败',
	'200017':'流程不存在或流程没结束不能删除',
	'200018':'流程单号已存在',
	'200019':'流程终止失败',

	//登录模块
	'100240':'该用户未被邀请注册',
	'100241':'输入的密码有误',
	'100242':'该用户未激活',
	'100243':'该用户已被禁用',
	'100244':'请获取短信验证码',
	'100245':'短信验证码过期，请重新获取短信验证码',
	'100246':'短信验证码错误',
	'100247':'未提供手机号码',
	'100248':'图片验证码无效，请重新获取',
	'100249':'图片验证码输入错误',
	'100250':'您是首次登录本系统，请直接使用手机号加验证码的方式登录',
	'100251':'验证码错误，请刷新后重试',
	'100252':'输入的数据有误',
	'100253':'修改的密码和当前密码相同',
	'100254':'短信验证码超过单日上限',

	//仓库
	'100301':'仓库不存在',
	'100300':'地址名称重复',

	//资金账户
	"102501":"账户不存在",
	"102500":"账户名称重复",
	"102503":"币种不存在",
	"102502":"银行不存在",

	//设计BOM
	"100260":"错误的标识",
	"100261":"错误的模版",
	"100262":"模版内部错误, 请及时处理",
	"100263":"BOM信息不能为空",
	"100264":"物料属性不存在, 请先维护好SPU属性",
	"100265":"模版信息解析错误",
	"100266":"属性信息解析错误",
	"100267":"名称或编码解析错误",
	"100268":"BOM信息解析错误",
}
window.localStorage['ROLEPLAY_ERROR'] = JSON.stringify(ROLEPLAY_ERROR);







